opends/tests/functional-tests/shared/data/dsml/suites/06delmoddelsuite/data/del195.dat

POST /dsml HTTP/1.1
Host: Foo
Connection: Close
Content-Length: 758
SOAPAction: "#batchRequest"

<?xml version='1.0' encoding='UTF-8'?>
  <soap-env:Envelope
      xmlns:xsd='http://www.w3.org/2001/XMLSchema'
      xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
      xmlns:soap-env='http://schemas.xmlsoap.org/soap/envelope/'>
  <soap-env:Body>
  <batchRequest xmlns="urn:oasis:names:tc:DSML:2:0:core">
     <delRequest dn="uid=foo42, ou=People, o=dsmlfe.com">
     </delRequest>
     <delRequest dn="uid=foo43, ou=People, o=dsmlfe.com">
     </delRequest>
     <delRequest dn="uid=foo44, ou=People, o=dsmlfe.com">
     </delRequest>
     <delRequest dn="uid=foo45, ou=People, o=dsmlfe.com">
     </delRequest>
     <delRequest dn="uid=foo46, ou=People, o=dsmlfe.com">
     </delRequest>
  </batchRequest>
  </soap-env:Body>
  </soap-env:Envelope>
